In [55]:
import pandas as pd
import os
feb=pd.read_csv("Desktop/Data science practice/sales_february.csv")
feb['month']="feb"

jan=pd.read_csv("Desktop/Data science practice/sales_january.csv")
jan["month"]="jan"
jan

   order_id product  quantity  unit_price month
0         1   Apple        10         0.5   jan
1         2  Banana         5         0.3   jan
2         3  Orange         8         0.4   jan

In [47]:
combined_sales=pd.concat([feb, jan],ignore_index=False)

In [49]:
combined_sales.reset_index(drop=True, inplace=True)

In [71]:
combined_sales["total_price"]=combined_sales["quantity"]*combined_sales["unit_price"]
combined_sales=combined_sales.groupby(["product","month"]).agg({"quantity":"sum", "total_price":"sum"})

In [73]:
combined_sales

               quantity  total_price
product month
Apple   feb          12          6.6
        jan          10          5.0
Banana  feb           6          2.1
        jan           5          1.5
Mango   feb           3          3.6
Orange  jan           8          3.2

combined_sales.to_csv("combined_sales.csv")

In [80]:
combined_sales.to_csv("combined_sales.csv")

In [86]:
combined_sales

               quantity  total_price
product month
Apple   feb          12          6.6
        jan          10          5.0
Banana  feb           6          2.1
        jan           5          1.5
Mango   feb           3          3.6
Orange  jan           8          3.2

In [90]:
combined_sales.groupby(["quantity"]).agg({"quantity":"sum", "total_price":"sum"})

          quantity  total_price
quantity
3                3          3.6
5                5          1.5
6                6          2.1
8                8          3.2
10              10          5.0
12              12          6.6

In [92]:
print(combined_sales.columns)

Index(['quantity', 'total_price'], dtype='object')

In [100]:
summary=combined_sales.reset_index()

In [98]:
combined_sales.columns

Index(['quantity', 'total_price'], dtype='object')

In [102]:
summary.columns

Index(['product', 'month', 'quantity', 'total_price'], dtype='object')